analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/adc9_regs.h
/**
 * @file    adc9_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the ADC9 Peripheral Module.
 * @note    This file is @generated.
 */
/******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc., All Rights Reserved.
 * (now owned by Analog Devices, Inc.)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************
 *
 * Copyright 2023 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_ADC9_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_ADC9_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     adc9
 * @defgroup    adc9_registers ADC9_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the ADC9 Peripheral Module.
 * @details     Magnetic Strip Reader - 9 bit ADC
 */

/**
 * @ingroup adc9_registers
 * Structure type to access the ADC9 Registers.
 */
typedef struct {
    __IO uint32_t cfg;                  /**< <tt>\b 0x0000:</tt> ADC9 CFG Register */
    __IO uint32_t cmd;                  /**< <tt>\b 0x0004:</tt> ADC9 CMD Register */
    __IO uint32_t fifo;                 /**< <tt>\b 0x0008:</tt> ADC9 FIFO Register */
    __IO uint32_t intr;                 /**< <tt>\b 0x000C:</tt> ADC9 INTR Register */
    __IO uint32_t stat;                 /**< <tt>\b 0x0010:</tt> ADC9 STAT Register */
} mxc_adc9_regs_t;

/* Register offsets for module ADC9 */
/**
 * @ingroup    adc9_registers
 * @defgroup   ADC9_Register_Offsets Register Offsets
 * @brief      ADC9 Peripheral Register Offsets from the ADC9 Base Peripheral Address.
 * @{
 */
#define MXC_R_ADC9_CFG                     ((uint32_t)0x00000000UL) /**< Offset from ADC9 Base Address: <tt> 0x0000</tt> */
#define MXC_R_ADC9_CMD                     ((uint32_t)0x00000004UL) /**< Offset from ADC9 Base Address: <tt> 0x0004</tt> */
#define MXC_R_ADC9_FIFO                    ((uint32_t)0x00000008UL) /**< Offset from ADC9 Base Address: <tt> 0x0008</tt> */
#define MXC_R_ADC9_INTR                    ((uint32_t)0x0000000CUL) /**< Offset from ADC9 Base Address: <tt> 0x000C</tt> */
#define MXC_R_ADC9_STAT                    ((uint32_t)0x00000010UL) /**< Offset from ADC9 Base Address: <tt> 0x0010</tt> */
/**@} end of group adc9_registers */

/**
 * @ingroup  adc9_registers
 * @defgroup ADC9_CFG ADC9_CFG
 * @brief    ADC Control
 * @{
 */
#define MXC_F_ADC9_CFG_CLKDIV_POS                      0 /**< CFG_CLKDIV Position */
#define MXC_F_ADC9_CFG_CLKDIV                          ((uint32_t)(0xFFUL << MXC_F_ADC9_CFG_CLKDIV_POS)) /**< CFG_CLKDIV Mask */

#define MXC_F_ADC9_CFG_ACHSEL_POS                      8 /**< CFG_ACHSEL Position */
#define MXC_F_ADC9_CFG_ACHSEL                          ((uint32_t)(0x7UL << MXC_F_ADC9_CFG_ACHSEL_POS)) /**< CFG_ACHSEL Mask */
#define MXC_V_ADC9_CFG_ACHSEL_INVALID_000              ((uint32_t)0x0UL) /**< CFG_ACHSEL_INVALID_000 Value */
#define MXC_S_ADC9_CFG_ACHSEL_INVALID_000              (MXC_V_ADC9_CFG_ACHSEL_INVALID_000 << MXC_F_ADC9_CFG_ACHSEL_POS) /**< CFG_ACHSEL_INVALID_000 Setting */
#define MXC_V_ADC9_CFG_ACHSEL_IN0                      ((uint32_t)0x1UL) /**< CFG_ACHSEL_IN0 Value */
#define MXC_S_ADC9_CFG_ACHSEL_IN0                      (MXC_V_ADC9_CFG_ACHSEL_IN0 << MXC_F_ADC9_CFG_ACHSEL_POS) /**< CFG_ACHSEL_IN0 Setting */
#define MXC_V_ADC9_CFG_ACHSEL_IN1                      ((uint32_t)0x2UL) /**< CFG_ACHSEL_IN1 Value */
#define MXC_S_ADC9_CFG_ACHSEL_IN1                      (MXC_V_ADC9_CFG_ACHSEL_IN1 << MXC_F_ADC9_CFG_ACHSEL_POS) /**< CFG_ACHSEL_IN1 Setting */
#define MXC_V_ADC9_CFG_ACHSEL_IN2                      ((uint32_t)0x3UL) /**< CFG_ACHSEL_IN2 Value */
#define MXC_S_ADC9_CFG_ACHSEL_IN2                      (MXC_V_ADC9_CFG_ACHSEL_IN2 << MXC_F_ADC9_CFG_ACHSEL_POS) /**< CFG_ACHSEL_IN2 Setting */
#define MXC_V_ADC9_CFG_ACHSEL_IN3                      ((uint32_t)0x4UL) /**< CFG_ACHSEL_IN3 Value */
#define MXC_S_ADC9_CFG_ACHSEL_IN3                      (MXC_V_ADC9_CFG_ACHSEL_IN3 << MXC_F_ADC9_CFG_ACHSEL_POS) /**< CFG_ACHSEL_IN3 Setting */
#define MXC_V_ADC9_CFG_ACHSEL_IN4                      ((uint32_t)0x5UL) /**< CFG_ACHSEL_IN4 Value */
#define MXC_S_ADC9_CFG_ACHSEL_IN4                      (MXC_V_ADC9_CFG_ACHSEL_IN4 << MXC_F_ADC9_CFG_ACHSEL_POS) /**< CFG_ACHSEL_IN4 Setting */
#define MXC_V_ADC9_CFG_ACHSEL_IN5                      ((uint32_t)0x6UL) /**< CFG_ACHSEL_IN5 Value */
#define MXC_S_ADC9_CFG_ACHSEL_IN5                      (MXC_V_ADC9_CFG_ACHSEL_IN5 << MXC_F_ADC9_CFG_ACHSEL_POS) /**< CFG_ACHSEL_IN5 Setting */
#define MXC_V_ADC9_CFG_ACHSEL_INVALID_111              ((uint32_t)0x7UL) /**< CFG_ACHSEL_INVALID_111 Value */
#define MXC_S_ADC9_CFG_ACHSEL_INVALID_111              (MXC_V_ADC9_CFG_ACHSEL_INVALID_111 << MXC_F_ADC9_CFG_ACHSEL_POS) /**< CFG_ACHSEL_INVALID_111 Setting */

