analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/adc9_regs.h
#define MXC_F_ADC9_CFG_BCHSEL_POS                      11 /**< CFG_BCHSEL Position */
#define MXC_F_ADC9_CFG_BCHSEL                          ((uint32_t)(0x7UL << MXC_F_ADC9_CFG_BCHSEL_POS)) /**< CFG_BCHSEL Mask */

#define MXC_F_ADC9_CFG_CCHSEL_POS                      14 /**< CFG_CCHSEL Position */
#define MXC_F_ADC9_CFG_CCHSEL                          ((uint32_t)(0x7UL << MXC_F_ADC9_CFG_CCHSEL_POS)) /**< CFG_CCHSEL Mask */

#define MXC_F_ADC9_CFG_DCHSEL_POS                      17 /**< CFG_DCHSEL Position */
#define MXC_F_ADC9_CFG_DCHSEL                          ((uint32_t)(0x7UL << MXC_F_ADC9_CFG_DCHSEL_POS)) /**< CFG_DCHSEL Mask */

#define MXC_F_ADC9_CFG_ECHSEL_POS                      20 /**< CFG_ECHSEL Position */
#define MXC_F_ADC9_CFG_ECHSEL                          ((uint32_t)(0x7UL << MXC_F_ADC9_CFG_ECHSEL_POS)) /**< CFG_ECHSEL Mask */

#define MXC_F_ADC9_CFG_FCHSEL_POS                      23 /**< CFG_FCHSEL Position */
#define MXC_F_ADC9_CFG_FCHSEL                          ((uint32_t)(0x7UL << MXC_F_ADC9_CFG_FCHSEL_POS)) /**< CFG_FCHSEL Mask */

#define MXC_F_ADC9_CFG_GCHSEL_POS                      26 /**< CFG_GCHSEL Position */
#define MXC_F_ADC9_CFG_GCHSEL                          ((uint32_t)(0x7UL << MXC_F_ADC9_CFG_GCHSEL_POS)) /**< CFG_GCHSEL Mask */

#define MXC_F_ADC9_CFG_HCHSEL_POS                      29 /**< CFG_HCHSEL Position */
#define MXC_F_ADC9_CFG_HCHSEL                          ((uint32_t)(0x7UL << MXC_F_ADC9_CFG_HCHSEL_POS)) /**< CFG_HCHSEL Mask */

/**@} end of group ADC9_CFG_Register */

/**
 * @ingroup  adc9_registers
 * @defgroup ADC9_CMD ADC9_CMD
 * @brief    MSRADC Command
 * @{
 */
#define MXC_F_ADC9_CMD_RST_POS                         0 /**< CMD_RST Position */
#define MXC_F_ADC9_CMD_RST                             ((uint32_t)(0x1UL << MXC_F_ADC9_CMD_RST_POS)) /**< CMD_RST Mask */

#define MXC_F_ADC9_CMD_SNGLSMPL_POS                    1 /**< CMD_SNGLSMPL Position */
#define MXC_F_ADC9_CMD_SNGLSMPL                        ((uint32_t)(0x1UL << MXC_F_ADC9_CMD_SNGLSMPL_POS)) /**< CMD_SNGLSMPL Mask */

#define MXC_F_ADC9_CMD_CONTSMPL_POS                    2 /**< CMD_CONTSMPL Position */
#define MXC_F_ADC9_CMD_CONTSMPL                        ((uint32_t)(0x1UL << MXC_F_ADC9_CMD_CONTSMPL_POS)) /**< CMD_CONTSMPL Mask */

#define MXC_F_ADC9_CMD_ROTLIMIT_POS                    4 /**< CMD_ROTLIMIT Position */
#define MXC_F_ADC9_CMD_ROTLIMIT                        ((uint32_t)(0x7UL << MXC_F_ADC9_CMD_ROTLIMIT_POS)) /**< CMD_ROTLIMIT Mask */
#define MXC_V_ADC9_CMD_ROTLIMIT_1_CHANNEL              ((uint32_t)0x0UL) /**< CMD_ROTLIMIT_1_CHANNEL Value */
#define MXC_S_ADC9_CMD_ROTLIMIT_1_CHANNEL              (MXC_V_ADC9_CMD_ROTLIMIT_1_CHANNEL << MXC_F_ADC9_CMD_ROTLIMIT_POS) /**< CMD_ROTLIMIT_1_CHANNEL Setting */
#define MXC_V_ADC9_CMD_ROTLIMIT_2_CHANNELS             ((uint32_t)0x1UL) /**< CMD_ROTLIMIT_2_CHANNELS Value */
#define MXC_S_ADC9_CMD_ROTLIMIT_2_CHANNELS             (MXC_V_ADC9_CMD_ROTLIMIT_2_CHANNELS << MXC_F_ADC9_CMD_ROTLIMIT_POS) /**< CMD_ROTLIMIT_2_CHANNELS Setting */
#define MXC_V_ADC9_CMD_ROTLIMIT_3_CHANNELS             ((uint32_t)0x2UL) /**< CMD_ROTLIMIT_3_CHANNELS Value */
#define MXC_S_ADC9_CMD_ROTLIMIT_3_CHANNELS             (MXC_V_ADC9_CMD_ROTLIMIT_3_CHANNELS << MXC_F_ADC9_CMD_ROTLIMIT_POS) /**< CMD_ROTLIMIT_3_CHANNELS Setting */
#define MXC_V_ADC9_CMD_ROTLIMIT_4_CHANNELS             ((uint32_t)0x3UL) /**< CMD_ROTLIMIT_4_CHANNELS Value */
#define MXC_S_ADC9_CMD_ROTLIMIT_4_CHANNELS             (MXC_V_ADC9_CMD_ROTLIMIT_4_CHANNELS << MXC_F_ADC9_CMD_ROTLIMIT_POS) /**< CMD_ROTLIMIT_4_CHANNELS Setting */
#define MXC_V_ADC9_CMD_ROTLIMIT_5_CHANNELS             ((uint32_t)0x4UL) /**< CMD_ROTLIMIT_5_CHANNELS Value */
#define MXC_S_ADC9_CMD_ROTLIMIT_5_CHANNELS             (MXC_V_ADC9_CMD_ROTLIMIT_5_CHANNELS << MXC_F_ADC9_CMD_ROTLIMIT_POS) /**< CMD_ROTLIMIT_5_CHANNELS Setting */
#define MXC_V_ADC9_CMD_ROTLIMIT_6_CHANNELS             ((uint32_t)0x5UL) /**< CMD_ROTLIMIT_6_CHANNELS Value */
#define MXC_S_ADC9_CMD_ROTLIMIT_6_CHANNELS             (MXC_V_ADC9_CMD_ROTLIMIT_6_CHANNELS << MXC_F_ADC9_CMD_ROTLIMIT_POS) /**< CMD_ROTLIMIT_6_CHANNELS Setting */
#define MXC_V_ADC9_CMD_ROTLIMIT_7_CHANNELS             ((uint32_t)0x6UL) /**< CMD_ROTLIMIT_7_CHANNELS Value */
#define MXC_S_ADC9_CMD_ROTLIMIT_7_CHANNELS             (MXC_V_ADC9_CMD_ROTLIMIT_7_CHANNELS << MXC_F_ADC9_CMD_ROTLIMIT_POS) /**< CMD_ROTLIMIT_7_CHANNELS Setting */
#define MXC_V_ADC9_CMD_ROTLIMIT_8_CHANNELS             ((uint32_t)0x7UL) /**< CMD_ROTLIMIT_8_CHANNELS Value */
#define MXC_S_ADC9_CMD_ROTLIMIT_8_CHANNELS             (MXC_V_ADC9_CMD_ROTLIMIT_8_CHANNELS << MXC_F_ADC9_CMD_ROTLIMIT_POS) /**< CMD_ROTLIMIT_8_CHANNELS Setting */

#define MXC_F_ADC9_CMD_CLKSEL_POS                      8 /**< CMD_CLKSEL Position */
#define MXC_F_ADC9_CMD_CLKSEL                          ((uint32_t)(0x7UL << MXC_F_ADC9_CMD_CLKSEL_POS)) /**< CMD_CLKSEL Mask */
#define MXC_V_ADC9_CMD_CLKSEL_3_SAMPLES                ((uint32_t)0x0UL) /**< CMD_CLKSEL_3_SAMPLES Value */
#define MXC_S_ADC9_CMD_CLKSEL_3_SAMPLES                (MXC_V_ADC9_CMD_CLKSEL_3_SAMPLES << MXC_F_ADC9_CMD_CLKSEL_POS) /**< CMD_CLKSEL_3_SAMPLES Setting */
#define MXC_V_ADC9_CMD_CLKSEL_5_SAMPLES                ((uint32_t)0x1UL) /**< CMD_CLKSEL_5_SAMPLES Value */
#define MXC_S_ADC9_CMD_CLKSEL_5_SAMPLES                (MXC_V_ADC9_CMD_CLKSEL_5_SAMPLES << MXC_F_ADC9_CMD_CLKSEL_POS) /**< CMD_CLKSEL_5_SAMPLES Setting */
#define MXC_V_ADC9_CMD_CLKSEL_4_SAMPLES                ((uint32_t)0x2UL) /**< CMD_CLKSEL_4_SAMPLES Value */
#define MXC_S_ADC9_CMD_CLKSEL_4_SAMPLES                (MXC_V_ADC9_CMD_CLKSEL_4_SAMPLES << MXC_F_ADC9_CMD_CLKSEL_POS) /**< CMD_CLKSEL_4_SAMPLES Setting */
#define MXC_V_ADC9_CMD_CLKSEL_8_SAMPLES                ((uint32_t)0x3UL) /**< CMD_CLKSEL_8_SAMPLES Value */
#define MXC_S_ADC9_CMD_CLKSEL_8_SAMPLES                (MXC_V_ADC9_CMD_CLKSEL_8_SAMPLES << MXC_F_ADC9_CMD_CLKSEL_POS) /**< CMD_CLKSEL_8_SAMPLES Setting */
#define MXC_V_ADC9_CMD_CLKSEL_16_SAMPLES               ((uint32_t)0x4UL) /**< CMD_CLKSEL_16_SAMPLES Value */
#define MXC_S_ADC9_CMD_CLKSEL_16_SAMPLES               (MXC_V_ADC9_CMD_CLKSEL_16_SAMPLES << MXC_F_ADC9_CMD_CLKSEL_POS) /**< CMD_CLKSEL_16_SAMPLES Setting */
#define MXC_V_ADC9_CMD_CLKSEL_32_SAMPLES               ((uint32_t)0x5UL) /**< CMD_CLKSEL_32_SAMPLES Value */
#define MXC_S_ADC9_CMD_CLKSEL_32_SAMPLES               (MXC_V_ADC9_CMD_CLKSEL_32_SAMPLES << MXC_F_ADC9_CMD_CLKSEL_POS) /**< CMD_CLKSEL_32_SAMPLES Setting */
#define MXC_V_ADC9_CMD_CLKSEL_64_SAMPLES               ((uint32_t)0x6UL) /**< CMD_CLKSEL_64_SAMPLES Value */
#define MXC_S_ADC9_CMD_CLKSEL_64_SAMPLES               (MXC_V_ADC9_CMD_CLKSEL_64_SAMPLES << MXC_F_ADC9_CMD_CLKSEL_POS) /**< CMD_CLKSEL_64_SAMPLES Setting */
#define MXC_V_ADC9_CMD_CLKSEL_128_SAMPLES              ((uint32_t)0x7UL) /**< CMD_CLKSEL_128_SAMPLES Value */
#define MXC_S_ADC9_CMD_CLKSEL_128_SAMPLES              (MXC_V_ADC9_CMD_CLKSEL_128_SAMPLES << MXC_F_ADC9_CMD_CLKSEL_POS) /**< CMD_CLKSEL_128_SAMPLES Setting */

/**@} end of group ADC9_CMD_Register */

/**
 * @ingroup  adc9_registers
 * @defgroup ADC9_FIFO ADC9_FIFO
 * @brief    ADC FIFO
 * @{
 */
#define MXC_F_ADC9_FIFO_SAMPLE_POS                     0 /**< FIFO_SAMPLE Position */
#define MXC_F_ADC9_FIFO_SAMPLE                         ((uint32_t)(0x1FFUL << MXC_F_ADC9_FIFO_SAMPLE_POS)) /**< FIFO_SAMPLE Mask */

