analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/adc9_regs.h
#define MXC_F_ADC9_FIFO_SMPLIN_POS                     9 /**< FIFO_SMPLIN Position */
#define MXC_F_ADC9_FIFO_SMPLIN                         ((uint32_t)(0x7UL << MXC_F_ADC9_FIFO_SMPLIN_POS)) /**< FIFO_SMPLIN Mask */
#define MXC_V_ADC9_FIFO_SMPLIN_INVALID_000             ((uint32_t)0x0UL) /**< FIFO_SMPLIN_INVALID_000 Value */
#define MXC_S_ADC9_FIFO_SMPLIN_INVALID_000             (MXC_V_ADC9_FIFO_SMPLIN_INVALID_000 << MXC_F_ADC9_FIFO_SMPLIN_POS) /**< FIFO_SMPLIN_INVALID_000 Setting */
#define MXC_V_ADC9_FIFO_SMPLIN_IN0                     ((uint32_t)0x1UL) /**< FIFO_SMPLIN_IN0 Value */
#define MXC_S_ADC9_FIFO_SMPLIN_IN0                     (MXC_V_ADC9_FIFO_SMPLIN_IN0 << MXC_F_ADC9_FIFO_SMPLIN_POS) /**< FIFO_SMPLIN_IN0 Setting */
#define MXC_V_ADC9_FIFO_SMPLIN_IN1                     ((uint32_t)0x2UL) /**< FIFO_SMPLIN_IN1 Value */
#define MXC_S_ADC9_FIFO_SMPLIN_IN1                     (MXC_V_ADC9_FIFO_SMPLIN_IN1 << MXC_F_ADC9_FIFO_SMPLIN_POS) /**< FIFO_SMPLIN_IN1 Setting */
#define MXC_V_ADC9_FIFO_SMPLIN_IN2                     ((uint32_t)0x3UL) /**< FIFO_SMPLIN_IN2 Value */
#define MXC_S_ADC9_FIFO_SMPLIN_IN2                     (MXC_V_ADC9_FIFO_SMPLIN_IN2 << MXC_F_ADC9_FIFO_SMPLIN_POS) /**< FIFO_SMPLIN_IN2 Setting */
#define MXC_V_ADC9_FIFO_SMPLIN_IN3                     ((uint32_t)0x4UL) /**< FIFO_SMPLIN_IN3 Value */
#define MXC_S_ADC9_FIFO_SMPLIN_IN3                     (MXC_V_ADC9_FIFO_SMPLIN_IN3 << MXC_F_ADC9_FIFO_SMPLIN_POS) /**< FIFO_SMPLIN_IN3 Setting */
#define MXC_V_ADC9_FIFO_SMPLIN_IN4                     ((uint32_t)0x5UL) /**< FIFO_SMPLIN_IN4 Value */
#define MXC_S_ADC9_FIFO_SMPLIN_IN4                     (MXC_V_ADC9_FIFO_SMPLIN_IN4 << MXC_F_ADC9_FIFO_SMPLIN_POS) /**< FIFO_SMPLIN_IN4 Setting */
#define MXC_V_ADC9_FIFO_SMPLIN_IN5                     ((uint32_t)0x6UL) /**< FIFO_SMPLIN_IN5 Value */
#define MXC_S_ADC9_FIFO_SMPLIN_IN5                     (MXC_V_ADC9_FIFO_SMPLIN_IN5 << MXC_F_ADC9_FIFO_SMPLIN_POS) /**< FIFO_SMPLIN_IN5 Setting */
#define MXC_V_ADC9_FIFO_SMPLIN_INVALID_111             ((uint32_t)0x7UL) /**< FIFO_SMPLIN_INVALID_111 Value */
#define MXC_S_ADC9_FIFO_SMPLIN_INVALID_111             (MXC_V_ADC9_FIFO_SMPLIN_INVALID_111 << MXC_F_ADC9_FIFO_SMPLIN_POS) /**< FIFO_SMPLIN_INVALID_111 Setting */

/**@} end of group ADC9_FIFO_Register */

/**
 * @ingroup  adc9_registers
 * @defgroup ADC9_INTR ADC9_INTR
 * @brief    ADC Interrupt Enable Register
 * @{
 */
#define MXC_F_ADC9_INTR_FIFOLVL_POS                    0 /**< INTR_FIFOLVL Position */
#define MXC_F_ADC9_INTR_FIFOLVL                        ((uint32_t)(0x7UL << MXC_F_ADC9_INTR_FIFOLVL_POS)) /**< INTR_FIFOLVL Mask */
#define MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_1             ((uint32_t)0x0UL) /**< INTR_FIFOLVL_AT_LEAST_1 Value */
#define MXC_S_ADC9_INTR_FIFOLVL_AT_LEAST_1             (MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_1 << MXC_F_ADC9_INTR_FIFOLVL_POS) /**< INTR_FIFOLVL_AT_LEAST_1 Setting */
#define MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_2             ((uint32_t)0x1UL) /**< INTR_FIFOLVL_AT_LEAST_2 Value */
#define MXC_S_ADC9_INTR_FIFOLVL_AT_LEAST_2             (MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_2 << MXC_F_ADC9_INTR_FIFOLVL_POS) /**< INTR_FIFOLVL_AT_LEAST_2 Setting */
#define MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_3             ((uint32_t)0x2UL) /**< INTR_FIFOLVL_AT_LEAST_3 Value */
#define MXC_S_ADC9_INTR_FIFOLVL_AT_LEAST_3             (MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_3 << MXC_F_ADC9_INTR_FIFOLVL_POS) /**< INTR_FIFOLVL_AT_LEAST_3 Setting */
#define MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_4             ((uint32_t)0x3UL) /**< INTR_FIFOLVL_AT_LEAST_4 Value */
#define MXC_S_ADC9_INTR_FIFOLVL_AT_LEAST_4             (MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_4 << MXC_F_ADC9_INTR_FIFOLVL_POS) /**< INTR_FIFOLVL_AT_LEAST_4 Setting */
#define MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_5             ((uint32_t)0x4UL) /**< INTR_FIFOLVL_AT_LEAST_5 Value */
#define MXC_S_ADC9_INTR_FIFOLVL_AT_LEAST_5             (MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_5 << MXC_F_ADC9_INTR_FIFOLVL_POS) /**< INTR_FIFOLVL_AT_LEAST_5 Setting */
#define MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_6             ((uint32_t)0x5UL) /**< INTR_FIFOLVL_AT_LEAST_6 Value */
#define MXC_S_ADC9_INTR_FIFOLVL_AT_LEAST_6             (MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_6 << MXC_F_ADC9_INTR_FIFOLVL_POS) /**< INTR_FIFOLVL_AT_LEAST_6 Setting */
#define MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_7             ((uint32_t)0x6UL) /**< INTR_FIFOLVL_AT_LEAST_7 Value */
#define MXC_S_ADC9_INTR_FIFOLVL_AT_LEAST_7             (MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_7 << MXC_F_ADC9_INTR_FIFOLVL_POS) /**< INTR_FIFOLVL_AT_LEAST_7 Setting */
#define MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_8             ((uint32_t)0x7UL) /**< INTR_FIFOLVL_AT_LEAST_8 Value */
#define MXC_S_ADC9_INTR_FIFOLVL_AT_LEAST_8             (MXC_V_ADC9_INTR_FIFOLVL_AT_LEAST_8 << MXC_F_ADC9_INTR_FIFOLVL_POS) /**< INTR_FIFOLVL_AT_LEAST_8 Setting */

#define MXC_F_ADC9_INTR_DMAREQEN_POS                   3 /**< INTR_DMAREQEN Position */
#define MXC_F_ADC9_INTR_DMAREQEN                       ((uint32_t)(0x1UL << MXC_F_ADC9_INTR_DMAREQEN_POS)) /**< INTR_DMAREQEN Mask */

#define MXC_F_ADC9_INTR_OVERFIE_POS                    6 /**< INTR_OVERFIE Position */
#define MXC_F_ADC9_INTR_OVERFIE                        ((uint32_t)(0x1UL << MXC_F_ADC9_INTR_OVERFIE_POS)) /**< INTR_OVERFIE Mask */

#define MXC_F_ADC9_INTR_UNDRFIE_POS                    7 /**< INTR_UNDRFIE Position */
#define MXC_F_ADC9_INTR_UNDRFIE                        ((uint32_t)(0x1UL << MXC_F_ADC9_INTR_UNDRFIE_POS)) /**< INTR_UNDRFIE Mask */

#define MXC_F_ADC9_INTR_FIFOLVLIE_POS                  8 /**< INTR_FIFOLVLIE Position */
#define MXC_F_ADC9_INTR_FIFOLVLIE                      ((uint32_t)(0x1UL << MXC_F_ADC9_INTR_FIFOLVLIE_POS)) /**< INTR_FIFOLVLIE Mask */

#define MXC_F_ADC9_INTR_GLOBIE_POS                     9 /**< INTR_GLOBIE Position */
#define MXC_F_ADC9_INTR_GLOBIE                         ((uint32_t)(0x1UL << MXC_F_ADC9_INTR_GLOBIE_POS)) /**< INTR_GLOBIE Mask */

/**@} end of group ADC9_INTR_Register */

/**
 * @ingroup  adc9_registers
 * @defgroup ADC9_STAT ADC9_STAT
 * @brief    ADC Interrupt Flag Register.
 * @{
 */
#define MXC_F_ADC9_STAT_FIFOCNT_POS                    0 /**< STAT_FIFOCNT Position */
#define MXC_F_ADC9_STAT_FIFOCNT                        ((uint32_t)(0xFUL << MXC_F_ADC9_STAT_FIFOCNT_POS)) /**< STAT_FIFOCNT Mask */
#define MXC_V_ADC9_STAT_FIFOCNT_FIFO_EMPTY             ((uint32_t)0x0UL) /**< STAT_FIFOCNT_FIFO_EMPTY Value */
#define MXC_S_ADC9_STAT_FIFOCNT_FIFO_EMPTY             (MXC_V_ADC9_STAT_FIFOCNT_FIFO_EMPTY << MXC_F_ADC9_STAT_FIFOCNT_POS) /**< STAT_FIFOCNT_FIFO_EMPTY Setting */
#define MXC_V_ADC9_STAT_FIFOCNT_ONE_SAMPLE             ((uint32_t)0x1UL) /**< STAT_FIFOCNT_ONE_SAMPLE Value */
#define MXC_S_ADC9_STAT_FIFOCNT_ONE_SAMPLE             (MXC_V_ADC9_STAT_FIFOCNT_ONE_SAMPLE << MXC_F_ADC9_STAT_FIFOCNT_POS) /**< STAT_FIFOCNT_ONE_SAMPLE Setting */
#define MXC_V_ADC9_STAT_FIFOCNT_TWO_SAMPLE             ((uint32_t)0x2UL) /**< STAT_FIFOCNT_TWO_SAMPLE Value */
#define MXC_S_ADC9_STAT_FIFOCNT_TWO_SAMPLE             (MXC_V_ADC9_STAT_FIFOCNT_TWO_SAMPLE << MXC_F_ADC9_STAT_FIFOCNT_POS) /**< STAT_FIFOCNT_TWO_SAMPLE Setting */
#define MXC_V_ADC9_STAT_FIFOCNT_THREE_SAMPLE           ((uint32_t)0x3UL) /**< STAT_FIFOCNT_THREE_SAMPLE Value */
#define MXC_S_ADC9_STAT_FIFOCNT_THREE_SAMPLE           (MXC_V_ADC9_STAT_FIFOCNT_THREE_SAMPLE << MXC_F_ADC9_STAT_FIFOCNT_POS) /**< STAT_FIFOCNT_THREE_SAMPLE Setting */
#define MXC_V_ADC9_STAT_FIFOCNT_FOUR_SAMPLE            ((uint32_t)0x4UL) /**< STAT_FIFOCNT_FOUR_SAMPLE Value */
#define MXC_S_ADC9_STAT_FIFOCNT_FOUR_SAMPLE            (MXC_V_ADC9_STAT_FIFOCNT_FOUR_SAMPLE << MXC_F_ADC9_STAT_FIFOCNT_POS) /**< STAT_FIFOCNT_FOUR_SAMPLE Setting */
#define MXC_V_ADC9_STAT_FIFOCNT_FIVE_SAMPLE            ((uint32_t)0x5UL) /**< STAT_FIFOCNT_FIVE_SAMPLE Value */
#define MXC_S_ADC9_STAT_FIFOCNT_FIVE_SAMPLE            (MXC_V_ADC9_STAT_FIFOCNT_FIVE_SAMPLE << MXC_F_ADC9_STAT_FIFOCNT_POS) /**< STAT_FIFOCNT_FIVE_SAMPLE Setting */
#define MXC_V_ADC9_STAT_FIFOCNT_SIX_SAMPLE             ((uint32_t)0x6UL) /**< STAT_FIFOCNT_SIX_SAMPLE Value */
#define MXC_S_ADC9_STAT_FIFOCNT_SIX_SAMPLE             (MXC_V_ADC9_STAT_FIFOCNT_SIX_SAMPLE << MXC_F_ADC9_STAT_FIFOCNT_POS) /**< STAT_FIFOCNT_SIX_SAMPLE Setting */
#define MXC_V_ADC9_STAT_FIFOCNT_SEVEN_SAMPLE           ((uint32_t)0x7UL) /**< STAT_FIFOCNT_SEVEN_SAMPLE Value */
#define MXC_S_ADC9_STAT_FIFOCNT_SEVEN_SAMPLE           (MXC_V_ADC9_STAT_FIFOCNT_SEVEN_SAMPLE << MXC_F_ADC9_STAT_FIFOCNT_POS) /**< STAT_FIFOCNT_SEVEN_SAMPLE Setting */
#define MXC_V_ADC9_STAT_FIFOCNT_EIGHT_SAMPLE           ((uint32_t)0x8UL) /**< STAT_FIFOCNT_EIGHT_SAMPLE Value */
#define MXC_S_ADC9_STAT_FIFOCNT_EIGHT_SAMPLE           (MXC_V_ADC9_STAT_FIFOCNT_EIGHT_SAMPLE << MXC_F_ADC9_STAT_FIFOCNT_POS) /**< STAT_FIFOCNT_EIGHT_SAMPLE Setting */

#define MXC_F_ADC9_STAT_FULL_POS                       4 /**< STAT_FULL Position */
#define MXC_F_ADC9_STAT_FULL                           ((uint32_t)(0x1UL << MXC_F_ADC9_STAT_FULL_POS)) /**< STAT_FULL Mask */

#define MXC_F_ADC9_STAT_EMPTY_POS                      5 /**< STAT_EMPTY Position */
#define MXC_F_ADC9_STAT_EMPTY                          ((uint32_t)(0x1UL << MXC_F_ADC9_STAT_EMPTY_POS)) /**< STAT_EMPTY Mask */

#define MXC_F_ADC9_STAT_OVERFINT_POS                   6 /**< STAT_OVERFINT Position */
#define MXC_F_ADC9_STAT_OVERFINT                       ((uint32_t)(0x1UL << MXC_F_ADC9_STAT_OVERFINT_POS)) /**< STAT_OVERFINT Mask */

#define MXC_F_ADC9_STAT_UNDRFINT_POS                   7 /**< STAT_UNDRFINT Position */
#define MXC_F_ADC9_STAT_UNDRFINT                       ((uint32_t)(0x1UL << MXC_F_ADC9_STAT_UNDRFINT_POS)) /**< STAT_UNDRFINT Mask */

#define MXC_F_ADC9_STAT_FIFOLVLST_POS                  8 /**< STAT_FIFOLVLST Position */
#define MXC_F_ADC9_STAT_FIFOLVLST                      ((uint32_t)(0x1UL << MXC_F_ADC9_STAT_FIFOLVLST_POS)) /**< STAT_FIFOLVLST Mask */

#define MXC_F_ADC9_STAT_GLOBINT_POS                    9 /**< STAT_GLOBINT Position */
#define MXC_F_ADC9_STAT_GLOBINT                        ((uint32_t)(0x1UL << MXC_F_ADC9_STAT_GLOBINT_POS)) /**< STAT_GLOBINT Mask */

/**@} end of group ADC9_STAT_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_ADC9_REGS_H_
